Documents/ПолучениеФактическихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПолучениеФактическихДанных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОборотыПоПланированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦФО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОборотыПоПланированию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоПланированию</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦФО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>ИСТИНА - Факт, ЛОЖЬ - План</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Оплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Оплаты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТабельУчетаРабочегоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОказанияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПоказателиПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиПланирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособГруппировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыГруппировкиПоказателяПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Специализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Сотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Номенклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный_Специализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный_Сотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный_Номенклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПолучениеФактическихДанных/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Проверяет заполнение необходимых аналитик для показателей планирования в табличной части документа.
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.План, ДокументОбъект.ПолучениеФактическихДанных - проверяемый документ.
//  ИмяТЧ			 - Строка - имя табличной части документа. 
//  Отказ			 - Булево - признак отказа.
//
Процедура ПроверитьЗаполнениеАналитик(ДокументОбъект, ИмяТЧ, Отказ) Экспорт

	МетаданныеТЧ = ДокументОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ);
	
	Если МетаданныеТЧ <> Неопределено Тогда 
		Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧ] Цикл
			МассивАналитики = Справочники.ПоказателиПланирования.ПолучитьНаименованияАналитик();
			Для Каждого Аналитика Из МассивАналитики Цикл 
				Если СтрокаТЧ.Показатель["Обязательный_" + Аналитика]
					И Не ЗначениеЗаполнено(СтрокаТЧ[Аналитика])	Тогда
					
					Отказ = Истина;
					Сообщение = НСтр("ru = 'В табличной части документа для показателя ""'") + Строка(СтрокаТЧ.Показатель) 
								+ НСтр("ru = '"" не заполнен реквизит ""'") + Аналитика
								+ НСтр("ru = '""!'");
				
					ОбщегоНазначения.СообщитьОбОшибке(Сообщение, Отказ);
				КонецЕсли;
			КонецЦикла;								 
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Заполняет фактические данные показателей планирования в табличной части документа. 
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.ПолучениеФактическихДанных - заполняемый документ.
//
Процедура ЗаполнитьФактическиеДанные(ДокументОбъект) Экспорт 
	
	МассивСтрокДляУдаления = Новый Массив;
	
	ТаблицаПоказатели = ПолучитьПоказателиПланированияЗаПериод(ДокументОбъект.Период);
	
	Если ТаблицаПоказатели.Количество() <> 0 Тогда
		Для Каждого СтрокаПоказатель Из ТаблицаПоказатели Цикл
			
			Если Не СтрокаПоказатель.Показатель.Предопределенный Тогда
				Продолжить;
			КонецЕсли;
			
			ТаблицаРезультат = ПолучитьФактПоказателяЗаПериод(СтрокаПоказатель);
			ОчиститьНеактуальныеИзмеренияФакта(СтрокаПоказатель.Показатель, ТаблицаРезультат);
			
			ОтборСтрок = Новый Структура("Показатель, ЦФО", СтрокаПоказатель.Показатель);
			Если СтрокаПоказатель.Показатель.Учет_Сотрудник Тогда
				ОтборСтрок.Вставить("Сотрудник");
			КонецЕсли;
			Если СтрокаПоказатель.Показатель.Учет_Специализация Тогда
				ОтборСтрок.Вставить("Специализация");
			КонецЕсли;
			Если СтрокаПоказатель.Показатель.Учет_Номенклатура Тогда
				ОтборСтрок.Вставить("Номенклатура");
			КонецЕсли;
			
			Для Каждого СтрокаРезультат Из ТаблицаРезультат Цикл
				// При совпадении измерений перезаполняем существующие строки, чтобы они сохранили позицию в документе.
				ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаРезультат);
				Если СтрокаРезультат.Значение <> 0 Тогда
					НайденныеСтроки = ДокументОбъект.ФактическиеДанные.НайтиСтроки(ОтборСтрок);
					Если НайденныеСтроки.Количество() <> 0 Тогда
						СтрокаФактическиеДанные = НайденныеСтроки[0];
						СтрокаФактическиеДанные.Значение = СтрокаРезультат.Значение;
					Иначе
						СтрокаФактическиеДанные = ДокументОбъект.ФактическиеДанные.Добавить();
						СтрокаФактическиеДанные.Показатель = СтрокаПоказатель.Показатель;
						ЗаполнитьЗначенияСвойств(СтрокаФактическиеДанные, СтрокаРезультат);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			// Удаление старых строк этого показателя, для которых не было получено значение в ТаблицаРезультат.
			ОтборСтрок.Удалить("Показатель");
			СтрокиФактическиеДанные = ДокументОбъект.ФактическиеДанные.НайтиСтроки(Новый Структура("Показатель, ЦФО", СтрокаПоказатель.Показатель, СтрокаПоказатель.ЦФО));
			Для Каждого СтрокаФактическиеДанные Из СтрокиФактическиеДанные Цикл
				ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаФактическиеДанные);
				Если ТаблицаРезультат.НайтиСтроки(ОтборСтрок).Количество() = 0 Тогда
					МассивСтрокДляУдаления.Добавить(СтрокаФактическиеДанные);			
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// Удаление строк, предопределенные показатели которых не планируются.
	Для Каждого Строка Из ДокументОбъект.ФактическиеДанные Цикл		
		Если Строка.Показатель.Предопределенный 
			И (Строка.Значение = 0
				Или ТаблицаПоказатели.НайтиСтроки(Новый Структура("Показатель, ЦФО", Строка.Показатель, Строка.ЦФО)).Количество() = 0)
		Тогда 			
			МассивСтрокДляУдаления.Добавить(Строка);			
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Строка Из МассивСтрокДляУдаления Цикл		
		ДокументОбъект.ФактическиеДанные.Удалить(Строка);		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПоказателиПланированияЗаПериод(Знач Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОборотыПоПланированию.Период КАК Период,
	               |	ОборотыПоПланированию.Показатель КАК Показатель,
	               |	ОборотыПоПланированию.ЦФО КАК ЦФО
	               |ИЗ
	               |	РегистрНакопления.ОборотыПоПланированию КАК ОборотыПоПланированию
	               |ГДЕ
	               |	ОборотыПоПланированию.Период = &Период
	               |	И ОборотыПоПланированию.Сценарий";
	
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьФактПоказателяЗаПериод(СтрокаПоказатель)
	
	Результат = Новый ТаблицаЗначений;
	
	Показатель = СтрокаПоказатель.Показатель;
	Период = СтрокаПоказатель.Период;
	ЦФО = СтрокаПоказатель.ЦФО;
	
	Если Показатель = Справочники.ПоказателиПланирования.СуммаПродаж Тогда 
		
		Результат = РассчитатьСуммуПродажЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоУслуг Тогда 
		
		Результат = РассчитатьКоличествоУслугЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.СуммаОплат Тогда 
		
		Результат = РассчитатьСуммуОплатЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.СреднийЧекОбщий Тогда 
		
		Результат = РассчитатьСреднийЧекОбщийЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.СредняяСуммаПродажНаСотрудника Тогда 
		
		Результат = РассчитатьСреднююСуммуПродажНаСотрудникаЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоПациентовОбщее Тогда 
		
		Результат = РассчитатьКоличествоПациентовОбщееЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоСотруднику Тогда 
		
		Результат = РассчитатьКоличествоНовыхПациентовПоСотрудникуЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоПосещений Тогда 
		
		Результат = РассчитатьКоличествоПосещенийЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.СреднийЧекПоСотруднику Тогда 
		
		Результат = РассчитатьСреднийЧекПоСотрудникуЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоОтработанныхЧасовПоТабелю Тогда 
		
		Результат = РассчитатьКоличествоОтработанныхЧасовПоТабелюЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоНаправлению Тогда 
		
		Результат = РассчитатьКоличествоНовыхПациентовПоНаправлениюЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.КоличествоПациентовПоНаправлению Тогда 
		
		Результат = РассчитатьКоличествоПациентовПоНаправлениюЗаПериод(Период, ЦФО);		
		
	ИначеЕсли Показатель = Справочники.ПоказателиПланирования.СреднийЧекПоНаправлению Тогда 
		
		Результат = РассчитатьСреднийЧекПоНаправлениюЗаПериод(Период, ЦФО);		
		
	КонецЕсли;
	
	ОчиститьНеактуальныеИзмеренияФакта(Показатель, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьСуммуПродажЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки КАК Специализация,
	               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	               |	ПродажиОбороты.Филиал КАК ЦФО,
	               |	СУММА(ПродажиОбороты.СуммаОборот) КАК Значение
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Филиал = &Филиал) КАК ПродажиОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Номенклатура,
	               |	ПродажиОбороты.Филиал,
	               |	ПродажиОбороты.Сотрудник,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	 	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоУслугЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки КАК Специализация,
	               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	               |	ПродажиОбороты.Филиал КАК ЦФО,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК Значение
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	               |				И Филиал = &Филиал) КАК ПродажиОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Филиал,
	               |	ПродажиОбороты.Номенклатура,
	               |	ПродажиОбороты.Сотрудник,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьСуммуОплатЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОплатыОбороты.СуммаОборот) КАК Значение,
	               |	ОплатыОбороты.Филиал КАК ЦФО
	               |ИЗ
	               |	РегистрНакопления.Оплаты.Обороты(&НачалоПериода, &КонецПериода, , Филиал = &Филиал) КАК ОплатыОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатыОбороты.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьСреднийЧекОбщийЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.СуммаОборот КАК СуммаОборот,
	               |	ПродажиОбороты.Регистратор КАК Регистратор,
	               |	ПродажиОбороты.ПериодДень КАК ПериодДень,
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Филиал КАК Филиал,
	               |	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
	               |ПОМЕСТИТЬ Продажи
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Продажи.СуммаОборот) КАК Сумма,
	               |	Продажи.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаПродаж
	               |ИЗ
	               |	Продажи КАК Продажи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.ПериодДень) КАК Количество,
	               |	Продажи.Филиал КАК Филиал,
	               |	Продажи.Клиент КАК Клиент
	               |ПОМЕСТИТЬ КоличествоЧековПоКлиентам
	               |ИЗ
	               |	Продажи КАК Продажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО Продажи.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И Продажи.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И Продажи.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (Продажи.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И Продажи.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	Продажи.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ Продажи.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Филиал,
	               |	Продажи.Клиент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(КоличествоЧековПоКлиентам.Количество) КАК СуммаЧеков,
	               |	КоличествоЧековПоКлиентам.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаВсехЧеков
	               |ИЗ
	               |	КоличествоЧековПоКлиентам КАК КоличествоЧековПоКлиентам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КоличествоЧековПоКлиентам.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Продажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ КоличествоЧековПоКлиентам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СуммаВсехЧеков.СуммаЧеков = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ СуммаПродаж.Сумма / СуммаВсехЧеков.СуммаЧеков
	               |	КОНЕЦ КАК Значение,
	               |	СуммаПродаж.Филиал КАК ЦФО
	               |ИЗ
	               |	СуммаПродаж КАК СуммаПродаж
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаВсехЧеков КАК СуммаВсехЧеков
	               |		ПО СуммаПродаж.Филиал = СуммаВсехЧеков.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

Функция РассчитатьСреднююСуммуПродажНаСотрудникаЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
	               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	               |	ПродажиОбороты.Филиал КАК Филиал
	               |ПОМЕСТИТЬ Продажи
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Филиал = &Филиал) КАК ПродажиОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Сотрудник,
	               |	ПродажиОбороты.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СРЕДНЕЕ(Продажи.Сумма) КАК Значение,
	               |	Продажи.Филиал КАК ЦФО
	               |ИЗ
	               |	Продажи КАК Продажи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоПациентовОбщееЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Клиент) КАК Значение,
	               |	ПродажиОбороты.Филиал КАК ЦФО
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ ПродажиОбороты.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоНовыхПациентовПоСотрудникуЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ПродажиОбороты.ПериодСекунда) КАК Период,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Регистратор.Сотрудник КАК Сотрудник,
	               |	ПродажиОбороты.Филиал КАК Филиал
	               |ПОМЕСТИТЬ КлиентыСотрудников
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ ПродажиОбороты.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Клиент,
	               |	ПродажиОбороты.Регистратор.Сотрудник,
	               |	ПродажиОбороты.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентыСотрудников.Клиент) КАК Значение,
	               |	КлиентыСотрудников.Сотрудник КАК Сотрудник,
	               |	КлиентыСотрудников.Филиал КАК ЦФО
	               |ИЗ
	               |	КлиентыСотрудников КАК КлиентыСотрудников
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &КонецПериода, Авто, ) КАК ПродажиОбороты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |			ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |				И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |				И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |				И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |				И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |				И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |		ПО КлиентыСотрудников.Клиент = ПродажиОбороты.Клиент
	               |			И КлиентыСотрудников.Период > ПродажиОбороты.ПериодСекунда
	               |			И (ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту))
	               |			И (НЕ ПродажиОбороты.Регистратор.Коррекция)
	               |			И (ВозвратыОбороты.Клиент ЕСТЬ NULL)
	               |ГДЕ
	               |	ПродажиОбороты.Клиент ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыСотрудников.Сотрудник,
	               |	КлиентыСотрудников.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоПосещенийЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.ПериодДень) КАК Количество,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Филиал КАК Филиал,
	               |	ПродажиОбороты.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ПосещенияКлиентов
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ ПродажиОбороты.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Клиент,
	               |	ПродажиОбороты.Филиал,
	               |	ПродажиОбороты.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПосещенияКлиентов.Количество) КАК Значение,
	               |	ПосещенияКлиентов.Филиал КАК ЦФО,
	               |	ПосещенияКлиентов.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	ПосещенияКлиентов КАК ПосещенияКлиентов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПосещенияКлиентов.Филиал,
	               |	ПосещенияКлиентов.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьСреднийЧекПоСотрудникуЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.СуммаОборот КАК СуммаОборот,
	               |	ПродажиОбороты.Регистратор КАК Регистратор,
	               |	ПродажиОбороты.ПериодДень КАК ПериодДень,
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	               |	ПродажиОбороты.Филиал КАК Филиал,
	               |	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
	               |ПОМЕСТИТЬ Продажи
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Продажи.СуммаОборот) КАК Сумма,
	               |	Продажи.Сотрудник КАК Сотрудник,
	               |	Продажи.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаПродаж
	               |ИЗ
	               |	Продажи КАК Продажи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Сотрудник,
	               |	Продажи.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.ПериодДень) КАК Количество,
	               |	Продажи.Сотрудник КАК Сотрудник,
	               |	Продажи.Филиал КАК Филиал,
	               |	Продажи.Клиент КАК Клиент
	               |ПОМЕСТИТЬ КоличествоЧековПоКлиентам
	               |ИЗ
	               |	Продажи КАК Продажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО Продажи.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И Продажи.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И Продажи.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (Продажи.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И Продажи.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	Продажи.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ Продажи.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Сотрудник,
	               |	Продажи.Филиал,
	               |	Продажи.Клиент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(КоличествоЧековПоКлиентам.Количество) КАК СуммаЧеков,
	               |	КоличествоЧековПоКлиентам.Сотрудник КАК Сотрудник,
	               |	КоличествоЧековПоКлиентам.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаВсехЧеков
	               |ИЗ
	               |	КоличествоЧековПоКлиентам КАК КоличествоЧековПоКлиентам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КоличествоЧековПоКлиентам.Сотрудник,
	               |	КоличествоЧековПоКлиентам.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Продажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ КоличествоЧековПоКлиентам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СуммаВсехЧеков.СуммаЧеков = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ СуммаПродаж.Сумма / СуммаВсехЧеков.СуммаЧеков
	               |	КОНЕЦ КАК Значение,
	               |	СуммаПродаж.Сотрудник КАК Сотрудник,
	               |	СуммаПродаж.Филиал КАК ЦФО
	               |ИЗ
	               |	СуммаПродаж КАК СуммаПродаж
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаВсехЧеков КАК СуммаВсехЧеков
	               |		ПО СуммаПродаж.Филиал = СуммаВсехЧеков.Филиал
	               |			И СуммаПродаж.Сотрудник = СуммаВсехЧеков.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоОтработанныхЧасовПоТабелюЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТабельУчетаРабочегоВремени.Часы) КАК Значение,
	               |	ТабельУчетаРабочегоВремени.Регистратор.Филиал КАК ЦФО,
	               |	ТабельУчетаРабочегоВремени.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.ТабельУчетаРабочегоВремени КАК ТабельУчетаРабочегоВремени
	               |ГДЕ
	               |	ТабельУчетаРабочегоВремени.День МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ТабельУчетаРабочегоВремени.Регистратор.Филиал = &Филиал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабельУчетаРабочегоВремени.Регистратор.Филиал,
	               |	ТабельУчетаРабочегоВремени.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоНовыхПациентовПоНаправлениюЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ПродажиОбороты.ПериодСекунда) КАК Период,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки КАК Специализация,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Филиал КАК Филиал
	               |ПОМЕСТИТЬ КлиентыПоНаправлениям
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ ПродажиОбороты.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки,
	               |	ПродажиОбороты.Клиент,
	               |	ПродажиОбороты.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыПоНаправлениям.Клиент КАК Клиент,
	               |	КлиентыПоНаправлениям.Специализация КАК Специализация,
	               |	КлиентыПоНаправлениям.Филиал КАК Филиал
	               |ПОМЕСТИТЬ НовыеКлиентыПоНаправлениям
	               |ИЗ
	               |	КлиентыПоНаправлениям КАК КлиентыПоНаправлениям
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &КонецПериода, Авто, ) КАК ПродажиОбороты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |			ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |				И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |				И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |				И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |				И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |				И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |		ПО КлиентыПоНаправлениям.Клиент = ПродажиОбороты.Клиент
	               |			И КлиентыПоНаправлениям.Период > ПродажиОбороты.ПериодСекунда
	               |			И (ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту))
	               |			И (НЕ ПродажиОбороты.Регистратор.Коррекция)
	               |			И (ВозвратыОбороты.Клиент ЕСТЬ NULL)
	               |ГДЕ
	               |	ПродажиОбороты.Клиент ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентыПоНаправлениям.Клиент) КАК Значение,
	               |	КлиентыПоНаправлениям.Филиал КАК ЦФО,
	               |	КлиентыПоНаправлениям.Специализация КАК Специализация,
	               |	ПродажиОбороты.Регистратор.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	КлиентыПоНаправлениям КАК КлиентыПоНаправлениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ПО КлиентыПоНаправлениям.Клиент = ПродажиОбороты.Клиент
	               |			И КлиентыПоНаправлениям.Период = ПродажиОбороты.ПериодСекунда
	               |			И КлиентыПоНаправлениям.Филиал = ПродажиОбороты.Филиал
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НовыеКлиентыПоНаправлениям КАК НовыеКлиентыПоНаправлениям
	               |		ПО КлиентыПоНаправлениям.Клиент = НовыеКлиентыПоНаправлениям.Клиент
	               |			И КлиентыПоНаправлениям.Специализация = НовыеКлиентыПоНаправлениям.Специализация
	               |			И КлиентыПоНаправлениям.Филиал = НовыеКлиентыПоНаправлениям.Филиал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыПоНаправлениям.Филиал,
	               |	КлиентыПоНаправлениям.Специализация,
	               |	ПродажиОбороты.Регистратор.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоПациентовПоНаправлениюЗаПериод(Период, ЦФО)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Клиент) КАК Значение,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки КАК Специализация,
	               |	ПродажиОбороты.Филиал КАК ЦФО
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО ПродажиОбороты.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И ПродажиОбороты.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (ПродажиОбороты.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И ПродажиОбороты.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ ПродажиОбороты.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки,
	               |	ПродажиОбороты.Филиал";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Функция РассчитатьСреднийЧекПоНаправлениюЗаПериод(Период, ЦФО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.СуммаОборот КАК СуммаОборот,
	               |	ПродажиОбороты.Регистратор КАК Регистратор,
	               |	ПродажиОбороты.ПериодДень КАК ПериодДень,
	               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |	ПродажиОбороты.Номенклатура.КатегорияВыработки КАК Специализация,
	               |	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПродажиОбороты.Клиент КАК Клиент,
	               |	ПродажиОбороты.Филиал КАК Филиал,
	               |	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
	               |ПОМЕСТИТЬ Продажи
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Филиал = &Филиал) КАК ПродажиОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Продажи.СуммаОборот) КАК Сумма,
	               |	Продажи.Специализация КАК Специализация,
	               |	Продажи.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаПродаж
	               |ИЗ
	               |	Продажи КАК Продажи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Специализация,
	               |	Продажи.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.ПериодДень) КАК Количество,
	               |	Продажи.Специализация КАК Специализация,
	               |	Продажи.Филиал КАК Филиал,
	               |	Продажи.Клиент КАК Клиент
	               |ПОМЕСТИТЬ КоличествоЧековПоКлиентам
	               |ИЗ
	               |	Продажи КАК Продажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ВозвратыОбороты
	               |		ПО Продажи.Регистратор = ВозвратыОбороты.Регистратор.ДокументОснование
	               |			И Продажи.Номенклатура = ВозвратыОбороты.Номенклатура
	               |			И Продажи.ХарактеристикаНоменклатуры = ВозвратыОбороты.ХарактеристикаНоменклатуры
	               |			И (Продажи.КоличествоОборот = -ВозвратыОбороты.КоличествоОборот)
	               |			И Продажи.ПериодДень = ВозвратыОбороты.ПериодДень
	               |			И (ВозвратыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту))
	               |ГДЕ
	               |	Продажи.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
	               |	И НЕ Продажи.Регистратор.Коррекция
	               |	И ВозвратыОбороты.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Специализация,
	               |	Продажи.Филиал,
	               |	Продажи.Клиент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(КоличествоЧековПоКлиентам.Количество) КАК СуммаЧеков,
	               |	КоличествоЧековПоКлиентам.Специализация КАК Специализация,
	               |	КоличествоЧековПоКлиентам.Филиал КАК Филиал
	               |ПОМЕСТИТЬ СуммаВсехЧеков
	               |ИЗ
	               |	КоличествоЧековПоКлиентам КАК КоличествоЧековПоКлиентам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КоличествоЧековПоКлиентам.Специализация,
	               |	КоличествоЧековПоКлиентам.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Продажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ КоличествоЧековПоКлиентам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СуммаВсехЧеков.СуммаЧеков = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ СуммаПродаж.Сумма / СуммаВсехЧеков.СуммаЧеков
	               |	КОНЕЦ КАК Значение,
	               |	СуммаПродаж.Специализация КАК Специализация,
	               |	СуммаПродаж.Филиал КАК ЦФО
	               |ИЗ
	               |	СуммаПродаж КАК СуммаПродаж
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаВсехЧеков КАК СуммаВсехЧеков
	               |		ПО СуммаПродаж.Филиал = СуммаВсехЧеков.Филиал
	               |			И СуммаПродаж.Специализация = СуммаВсехЧеков.Специализация";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Филиал", ЦФО);
	
 	Результат = Запрос.Выполнить().Выгрузить();
 	Возврат Результат;
	
КонецФункции

Процедура ОчиститьНеактуальныеИзмеренияФакта(Показатель, ТаблицаФакт)
	
	Если ТаблицаФакт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Измерения = Новый ТаблицаЗначений;
	Измерения.Колонки.Добавить("ИмяКолонки");
	Измерения.Колонки.Добавить("ИмяФлагаУчета");
	Измерения.Колонки.Добавить("ПустоеЗначение");
	
	НоваяСтрока = Измерения.Добавить();
	НоваяСтрока.ИмяКолонки = "Сотрудник";
	НоваяСтрока.ИмяФлагаУчета = "Учет_Сотрудник";
	НоваяСтрока.ПустоеЗначение = Справочники.Сотрудники.ПустаяСсылка();
	
	НоваяСтрока = Измерения.Добавить();
	НоваяСтрока.ИмяКолонки = "Специализация";
	НоваяСтрока.ИмяФлагаУчета = "Учет_Специализация";
	НоваяСтрока.ПустоеЗначение = Справочники.КатегорииВыработки.ПустаяСсылка();
	
	НоваяСтрока = Измерения.Добавить();
	НоваяСтрока.ИмяКолонки = "Номенклатура";
	НоваяСтрока.ИмяФлагаУчета = "Учет_Номенклатура";
	НоваяСтрока.ПустоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
	
	Для Каждого Измерение Из Измерения Цикл
		
		Если ТаблицаФакт.Колонки.Найти(Измерение.ИмяКолонки) <> Неопределено
			И Не Показатель[Измерение.ИмяФлагаУчета]
		Тогда
			
			Отбор = Новый Структура(Измерение.ИмяКолонки, Измерение.ПустоеЗначение);
			
			// Если есть не пустые значения в очередной колонке измерения, очищаем их.
			Если ТаблицаФакт.Количество() <> ТаблицаФакт.НайтиСтроки(Отбор).Количество() Тогда
				ТаблицаФакт.ЗаполнитьЗначения(Измерение.ПустоеЗначение, Измерение.ИмяКолонки);
				ДопСерверныеФункции.СвернутьТаблицуЗначений(ТаблицаФакт, "Значение");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
